lib/libc/sys/pledge.2
.\"" $BunnyBSD$
.Dd July 19, 2026
.Dt PLEDGE 2
.Os
.Sh NAME
.Nm pledge
.Nd restrict system operations
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.In unistd.h
.Ft int
.Fn pledge "const char *promises" "const char *execpromises"
.Sh DESCRIPTION
The
.Nm
system call forces the current process into a restricted operating mode
where only a subset of system calls can be invoked.
The subset is defined by the
.Ar promises
string, which contains a space-separated list of pledge groups.
.Pp
If a process makes a system call that is not permitted by its active promises,
it is terminated with a
.Dv SIGABRT
signal.
However, if the
.Dv error
(or
.Dv PLEDGE_ERROR )
promise was requested, the forbidden system call will instead fail with
.Er EPERM .
.Pp
Once a process has pledged, it can make subsequent calls to
.Nm
to further restrict its promises.
It is impossible to request promises that were not already active;
any attempt to expand the active set will fail with
.Er EPERM .
.Pp
The
.Ar execpromises
argument is currently not implemented in BunnyBSD and must be
.Dv NULL .
Specifying a non-null value will cause
.Nm
to fail with
.Er ENOSYS .
.Pp
Several system calls are restricted based on their arguments:
.Bl -tag -width "sysctl(2)"
.It Xr open 2
Requires
.Sy rpath
for read operations,
.Sy wpath
for write operations or truncation, and
.Sy cpath
if the
.Dv O_CREAT
flag is specified.
.It Xr socket 2
Requires
.Sy inet
for
.Dv AF_INET
and
.Dv AF_INET6
domains, and
.Sy unix
for
.Dv AF_UNIX .
Other domains are not permitted.
.It Xr ioctl 2
Only specific command groups are allowed.
TTY commands (group 't') require
.Sy tty ;
socket/network commands (group 'i') require
.Sy inet
or
.Sy unix ;
audio commands (groups 'A' and 'a') require
.Sy audio ;
generic file/descriptor operations (group 'f', such as FIONBIO and FIONREAD) are always allowed.
All other command groups are blocked.
.It Xr fcntl 2
Basic operations
.Pq Dv F_GETFD , F_SETFD , F_GETFL , F_SETFL , F_DUPFD*
are always allowed.
Locking operations
.Pq Dv F_GETLK , F_SETLK , F_SETLKW
require
.Sy flock .
Other commands are blocked.
.It Xr sysctl 2
Requires
.Sy sys_info .
Only read-only requests for
.Dv CTL_HW
and specific
.Dv CTL_KERN
nodes
.Pq KERN_HOSTNAME , KERN_DOMAINNAME , KERN_BOOTTIME , KERN_OSTYPE , KERN_OSRELEASE , KERN_VERSION
are allowed.
.El
.Sh PROMISES
The following promises are supported, each permitting the associated system calls:
.Bl -tag -width "execpromises"
.It Sy aio
.Xr aio_cancel 2 ,
.Xr aio_error 2 ,
.Xr aio_fsync 2 ,
.Xr aio_read 2 ,
.Xr aio_return 2 ,
.Xr aio_suspend 2 ,
.Xr aio_write 2 ,
.Xr lio_listio 2 .
.It Sy audio
.Xr ioctl 2 .
.It Sy chown
.Xr __posix_chown 2 ,
.Xr __posix_fchown 2 ,
.Xr __posix_lchown 2 ,
.Xr chown 2 ,
.Xr fchown 2 ,
.Xr fchownat 2 ,
.Xr lchown 2 .
.It Sy cpath
.Xr __posix_rename 2 ,
.Xr creat 2 ,
.Xr link 2 ,
.Xr linkat 2 ,
.Xr mkdir 2 ,
.Xr mkdirat 2 ,
.Xr mkfifo 2 ,
.Xr mkfifoat 2 ,
.Xr mknod 2 ,
.Xr mknodat 2 ,
.Xr open 2 ,
.Xr openat 2 ,
.Xr rename 2 ,
.Xr renameat 2 ,
.Xr rmdir 2 ,
.Xr symlink 2 ,
.Xr symlinkat 2 ,
.Xr undelete 2 ,
.Xr unlink 2 ,
.Xr unlinkat 2 .
.It Sy entropy
.Xr getrandom 2 .
.It Sy exec
.Xr execve 2 ,
.Xr fexecve 2 ,
.Xr posix_spawn 2 .
.It Sy fattr
.Xr __acl_delete_fd 2 ,
.Xr __acl_delete_file 2 ,
.Xr __acl_delete_link 2 ,
.Xr __acl_set_fd 2 ,
.Xr __acl_set_file 2 ,
.Xr __acl_set_link 2 ,
.Xr chflags 2 ,
.Xr chmod 2 ,
.Xr creat 2 ,
.Xr extattr_delete_fd 2 ,
.Xr extattr_delete_file 2 ,
.Xr extattr_delete_link 2 ,
.Xr extattr_set_fd 2 ,
.Xr extattr_set_file 2 ,
.Xr extattr_set_link 2 ,
.Xr fchflags 2 ,
.Xr fchmod 2 ,
.Xr fchmodat 2 ,
.Xr fremovexattr 2 ,
.Xr fsetxattr 2 ,
.Xr futimens 2 ,
.Xr futimes 2 ,
.Xr lchflags 2 ,
.Xr lchmod 2 ,
.Xr lremovexattr 2 ,
.Xr lsetxattr 2 ,
.Xr lutimes 2 ,
.Xr removexattr 2 ,
.Xr setxattr 2 ,
.Xr umask 2 ,
.Xr utimensat 2 ,
.Xr utimes 2 .
.It Sy file_metadata_read
.Xr fstat 2 ,
.Xr fstatat 2 ,
.Xr lstat 2 ,
.Xr stat 2 .
.It Sy flock
.Xr fcntl 2 ,
.Xr flock 2 .
.It Sy fs_sync
.Xr sync 2 .
.It Sy identity_get
.Xr getegid 2 ,
.Xr geteuid 2 ,
.Xr getgid_with_egid 2 ,
.Xr getgroups 2 ,
.Xr getpgid 2 ,
.Xr getpgrp 2 ,
.Xr getpid_with_ppid 2 ,
.Xr getppid 2 ,
.Xr getuid_with_euid 2 ,
.Xr issetugid 2 .
.It Sy identity_set
.Xr setegid 2 ,
.Xr seteuid 2 ,
.Xr setgid 2 ,
.Xr setgroups 2 ,
.Xr setregid 2 ,
.Xr setreuid 2 ,
.Xr setuid 2 .
.It Sy inet
.Xr accept 2 ,
.Xr bind 2 ,
.Xr connect 2 ,
.Xr getpeername 2 ,
.Xr getsockname 2 ,
.Xr getsockopt 2 ,
.Xr getsockopt2 2 ,
.Xr ioctl 2 ,
.Xr listen 2 ,
.Xr paccept 2 ,
.Xr recv 2 ,
.Xr recvfrom 2 ,
.Xr recvmmsg 2 ,
.Xr recvmsg 2 ,
.Xr send 2 ,
.Xr sendmmsg 2 ,
.Xr sendmsg 2 ,
.Xr sendto 2 ,
.Xr setsockopt 2 ,
.Xr shutdown 2 ,
.Xr socket 2 .
.It Sy memory_mgmt
.Xr madvise 2 ,
.Xr memfd_create 2 ,
.Xr mincore 2 ,
.Xr mmap 2 ,
.Xr mprotect 2 ,
.Xr mremap 2 ,
.Xr msync 2 ,
.Xr munmap 2 .
.It Sy multiplex
.Xr epoll_create1 2 ,
.Xr epoll_ctl 2 ,
.Xr epoll_pwait2 2 ,
.Xr eventfd 2 ,
.Xr kevent 2 ,
.Xr kqueue 2 ,
.Xr kqueue1 2 ,
.Xr poll 2 ,
.Xr pollts 2 ,
.Xr pselect 2 ,
.Xr select 2 .
.It Sy process_lifecycle
.Xr __clone 2 ,
.Xr fork 2 ,
.Xr kill 2 ,
.Xr killpg 2 ,
.Xr vfork 2 ,
.Xr wait 2 ,
.Xr wait4 2 ,
.Xr wait6 2 .
.It Sy process_meta
.Xr _sched_getaffinity 2 ,
.Xr _sched_getparam 2 ,
.Xr _sched_protect 2 ,
.Xr _sched_setaffinity 2 ,
.Xr _sched_setparam 2 ,
.Xr getpriority 2 ,
.Xr getrlimit 2 ,
.Xr getrusage 2 ,
.Xr getsid 2 ,
.Xr sched_yield 2 ,
.Xr setpgid 2 ,
.Xr setpriority 2 ,
.Xr setrlimit 2 ,
.Xr setsid 2 .
.It Sy rpath
.Xr __acl_aclcheck_fd 2 ,
.Xr __acl_aclcheck_file 2 ,
.Xr __acl_aclcheck_link 2 ,
.Xr __acl_get_fd 2 ,
.Xr __acl_get_file 2 ,
.Xr __acl_get_link 2 ,
.Xr __getcwd 2 ,
.Xr access 2 ,
.Xr chdir 2 ,
.Xr extattr_get_fd 2 ,
.Xr extattr_get_file 2 ,
.Xr extattr_get_link 2 ,
.Xr extattr_list_fd 2 ,
.Xr extattr_list_file 2 ,
.Xr extattr_list_link 2 ,
.Xr faccessat 2 ,
.Xr fchdir 2 ,
.Xr fgetxattr 2 ,
.Xr fhstatvfs1 2 ,
.Xr flistxattr 2 ,
.Xr fstatfs 2 ,
.Xr fstatvfs1 2 ,
.Xr getdents 2 ,
.Xr getdirentries 2 ,
.Xr getfsstat 2 ,
.Xr getvfsstat 2 ,
.Xr getxattr 2 ,
.Xr lgetxattr 2 ,
.Xr listxattr 2 ,
.Xr llistxattr 2 ,
.Xr lpathconf 2 ,
.Xr open 2 ,
.Xr openat 2 ,
.Xr pathconf 2 ,
.Xr readlink 2 ,
.Xr readlinkat 2 ,
.Xr statfs 2 ,
.Xr statvfs1 2 .
.It Sy signal
.Xr __sigaction_sigtramp 2 ,
.Xr __sigtimedwait 2 ,
.Xr getcontext 2 ,
.Xr setcontext 2 ,
.Xr sigaction 2 ,
.Xr sigaltstack 2 ,
.Xr sigblock 2 ,
.Xr sigpending 2 ,
.Xr sigprocmask 2 ,
.Xr sigreturn 2 ,
.Xr sigsetmask 2 ,
.Xr sigstack 2 ,
.Xr sigsuspend 2 ,
.Xr sigvec 2 .
.It Sy stdio
.Xr close 2 ,
.Xr dup 2 ,
.Xr dup2 2 ,
.Xr dup3 2 ,
.Xr fcntl 2 ,
.Xr fdatasync 2 ,
.Xr fsync 2 ,
.Xr fsync_range 2 ,
.Xr lseek 2 ,
.Xr pipe 2 ,
.Xr pipe2 2 ,
.Xr posix_fadvise 2 ,
.Xr pread 2 ,
.Xr preadv 2 ,
.Xr read 2 ,
.Xr readv 2 ,
.Xr write 2 .
.It Sy synchronization
.Xr __futex 2 ,
.Xr __futex_get_robust_list 2 ,
.Xr __futex_set_robust_list 2 ,
.Xr _ksem_close 2 ,
.Xr _ksem_destroy 2 ,
.Xr _ksem_getvalue 2 ,
.Xr _ksem_init 2 ,
.Xr _ksem_open 2 ,
.Xr _ksem_post 2 ,
.Xr _ksem_timedwait 2 ,
.Xr _ksem_trywait 2 ,
.Xr _ksem_unlink 2 ,
.Xr _ksem_wait 2 .
.It Sy sys_info
.Xr __sysctl 2 ,
.Xr fpathconf 2 ,
.Xr getdtablesize 2 ,
.Xr gethostid 2 ,
.Xr gethostname 2 ,
.Xr getpagesize 2 ,
.Xr uname 2 ,
.Xr uuidgen 2 .
.It Sy sysv_ipc
.Xr msgctl 2 ,
.Xr msgget 2 ,
.Xr msgrcv 2 ,
.Xr msgsnd 2 ,
.Xr semconfig 2 ,
.Xr semget 2 ,
.Xr semop 2 ,
.Xr semtimedop 2 ,
.Xr shmat 2 ,
.Xr shmctl 2 ,
.Xr shmdt 2 ,
.Xr shmget 2 .
.It Sy thread_lwp
.Xr _lwp_continue 2 ,
.Xr _lwp_create 2 ,
.Xr _lwp_ctl 2 ,
.Xr _lwp_detach 2 ,
.Xr _lwp_exit 2 ,
.Xr _lwp_getname 2 ,
.Xr _lwp_getprivate 2 ,
.Xr _lwp_kill 2 ,
.Xr _lwp_park 2 ,
.Xr _lwp_self 2 ,
.Xr _lwp_setname 2 ,
.Xr _lwp_setprivate 2 ,
.Xr _lwp_suspend 2 ,
.Xr _lwp_unpark 2 ,
.Xr _lwp_unpark_all 2 ,
.Xr _lwp_wait 2 ,
.Xr _lwp_wakeup 2 ,
.Xr sysarch 2 .
.It Sy time_read
.Xr clock_getcpuclockid2 2 ,
.Xr clock_getres 2 ,
.Xr clock_gettime 2 ,
.Xr gettimeofday 2 .
.It Sy time_set
.Xr adjtime 2 ,
.Xr clock_settime 2 ,
.Xr settimeofday 2 .
.It Sy timers_and_sleep
.Xr clock_nanosleep 2 ,
.Xr getitimer 2 ,
.Xr nanosleep 2 ,
.Xr setitimer 2 ,
.Xr timer_create 2 ,
.Xr timer_delete 2 ,
.Xr timer_getoverrun 2 ,
.Xr timer_gettime 2 ,
.Xr timer_settime 2 ,
.Xr timerfd_create 2 ,
.Xr timerfd_gettime 2 ,
.Xr timerfd_settime 2 .
.It Sy tty
.Xr ioctl 2 .
.It Sy unix
.Xr accept 2 ,
.Xr bind 2 ,
.Xr connect 2 ,
.Xr getpeername 2 ,
.Xr getsockname 2 ,
.Xr getsockopt 2 ,
.Xr getsockopt2 2 ,
.Xr listen 2 ,
.Xr paccept 2 ,
.Xr recv 2 ,
.Xr recvfrom 2 ,
.Xr recvmmsg 2 ,
.Xr recvmsg 2 ,
.Xr send 2 ,
.Xr sendmmsg 2 ,
.Xr sendmsg 2 ,
.Xr sendto 2 ,
.Xr setsockopt 2 ,
.Xr shutdown 2 ,
.Xr socket 2 ,
.Xr socketpair 2 .
.It Sy wpath
.Xr creat 2 ,
.Xr fdiscard 2 ,
.Xr ftruncate 2 ,
.Xr open 2 ,
.Xr openat 2 ,
.Xr posix_fallocate 2 ,
.Xr pwrite 2 ,
.Xr pwritev 2 ,
.Xr truncate 2 ,
.Xr writev 2 .
.El
.Sh RETURN VALUES
Upon successful completion, a value of 0 is returned.
Otherwise, -1 is returned and the global variable
.Va errno
is set to indicate the error.
.Sh ERRORS
.Bl -tag -width [EINVAL]
.It Bq Er EINVAL
An invalid promise was specified.
.It Bq Er ENOSYS
The
.Ar execpromises
argument was not
.Dv NULL .
This feature is not yet implemented.
.It Bq Er EPERM
An attempt was made to request a promise that was not active in the parent process.
.El
.Sh SEE ALSO
.Xr intro 2
.Sh HISTORY
The
.Nm
system call first appeared in
.Ox 5.9 .
It was ported to BunnyBSD in BunnyBSD 0.1.
